src/main/resources/xml/vertexNaveen.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:vertexinc:o-series:tps:6:0">
  <soapenv:Header/>
  <soapenv:Body>
    <VertexEnvelope xmlns="urn:vertexinc:o-series:tps:6:0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
      <Login>
        <TrustedId>asoqa_app</TrustedId>
      </Login>
      <QuotationRequest documentDate="2017-05-16" transactionType="SALE">
        <Currency/>
        <Seller>
          <Company/>
          <Division/>
        </Seller>
        <Customer>
          <CustomerCode classCode="2002"/>
          <Destination>
            <StreetAddress1>101 W 12th St Apt 16B</StreetAddress1>
            <StreetAddress2>123</StreetAddress2>
            <City>New York</City>
            <MainDivision>NY</MainDivision>
            <SubDivision/>
            <PostalCode>10012</PostalCode>
            <Country>USA</Country>
          </Destination>
        </Customer>
        <LineItem isMulticomponent="false" lineItemId="e636c954219076ff656faf8443" lineItemNumber="1">
          <Product productClass="">9781338195620-sso-us</Product>
          <Quantity>1</Quantity>
          <Freight>0</Freight>
          <UnitPrice>27.94</UnitPrice>
          <ExtendedPrice>27.94</ExtendedPrice>
        </LineItem>
      </QuotationRequest>
    </VertexEnvelope>
  </soapenv:Body>
</soapenv:Envelope>